//
//  AssesmentDataService.swift
//  FundYoung
//
//  Created by Janjao on 23/2/2561 BE.
//  Copyright © 2561 Janjao. All rights reserved.
//

import Foundation
class AssessmentDataService {
    static let instance = AssessmentDataService()
    private var Questions = [Question(question: "อายุปัจจุบันของท่าน"),
                             Question(question: "ระดับการศึกษาของท่าน"),
                             Question(question: "ประสบการณ์การลงทุนในหลักทรัพย์ของท่าน (หลักทรัพย์ หมายถึง หน่วยลงทุน หรือหุ้นกู้ หรือหุ้น หรือพันธบัตรรัฐบาล หรือตราสารอนุพันธ์)"),
                             Question(question: "ระยะเวลาที่ท่านคาดว่าจะไม่จำเป็นต้องใช้เงินลงทุนในส่วนนี้"),
                             Question(question: "ท่านต้องการรายได้จากเงินลงทุนในส่วนนี้เพื่อเป็นค่าใช้จ่ายประจำหรือไม่"),
                             Question(question: "สัดส่วนเงินลงทุนในส่วนนี้เทียบกับทรัพย์สินของท่าน"),
                             Question(question: "ทัศนคติเกี่ยวกับการลงทุน"),
                             Question(question: "การลงทุนในหลักทรัพย์ที่มีความผันผวนสูง มักให้ผลตอบแทนที่สูงในระยะยาว แต่มีความเสี่ยงที่จะทำให้ขาดทุนได้มากขึ้นเช่นกัน ท่านสามารถรับความเสี่ยงจากการลงทุนได้ในระดับใด"),
                             Question(question: "ในบางช่วงเวลา การลงทุนโดยเน้นความปลอดภัยของเงินลงทุนจะให้ผลตอบแทนในระดับที่ต่ำกว่าเงินเฟ้อ ซึ่งอาจจะทำให้อำนาจในการซื้อลดลงได้ เมื่อพิจารณาถึงเป้าหมายในการลงทุนของท่าน ข้อใดต่อไปนี้ ตรงกับท่านมากที่สุด"),
                             Question(question: "ท่านจะยอมรับผลขาดทุนจากการลงทุนในกองทุนรวมได้มากเพียงใด"),
                             Question(question: "ท่านสามารถรับความเสี่ยงด้านอัตราแลกเปลี่ยนได้หรือไม่")
        
        
    ]
    private var anwsers = [[Answer(answer: "เกิน 60 ปี", mark: 1),
                           Answer(answer: "ตั้งแต่ 50-60 ปี", mark: 2),
                           Answer(answer: "ตั้งแต่ 35-49 ปี", mark: 3),
                           Answer(answer: "ต่ำกว่า 35 ปี", mark: 4)],
                           [Answer(answer: "ต่ำกว่าปริญญาตรี", mark: 1),
                            Answer(answer: "ตั้งแต่ปริญญาตรีขึ้นไป", mark: 2)],
                           [Answer(answer: "ไม่มี", mark: 1),
                           Answer(answer: "น้อยกว่า 1 ปี", mark: 2),
                           Answer(answer: "ตั้งแต่ 1-5 ปี", mark: 3),
                           Answer(answer: "มากกว่า 5 ปี", mark: 4)],
                           [ Answer(answer: "น้อยกว่า 1 ปี", mark: 1),
                             Answer(answer: "ตั้งแต่ 1-3 ปี", mark: 2),
                             Answer(answer: "ตั้งแต่ 3-7 ปี", mark: 3),
                             Answer(answer: "มากกว่า 7 ปี", mark: 4)],
                           [ Answer(answer: "ต้องการมากที่สุด", mark: 1),
                             Answer(answer: "ต้องการบ้าง", mark: 2),
                             Answer(answer: "ต้องการเพียงเล็กน้อย", mark: 3),
                             Answer(answer: "ไม่มีความต้องการ", mark: 4)],
                           [ Answer(answer: "มากกว่าร้อยละ 60", mark: 1),
                             Answer(answer: "ร้อยละ 30-60", mark: 2),
                             Answer(answer: "ร้อยละ 10-30", mark: 3),
                             Answer(answer: "น้อยกว่าร้อยละ 10", mark: 4)],
                           [ Answer(answer: "ไม่สามารถทนต่อการขาดทุนเงินต้นได้เลย แม้ว่าจะมีโอกาสได้รับผลตอบแทนที่สูงขึ้นบ้าง", mark: 1),
                             Answer(answer: "สามารถทนต่อการขาดทุนเงินต้นได้เล็กน้อย เพื่อมีโอกาสได้รับผลตอบแทนที่สูงขึ้นบ้าง", mark: 2),
                             Answer(answer: "สามารถทนต่อการขาดทุนเงินต้นได้ เพื่อมีโอกาสได้รับผลตอบแทนที่สูงขึ้น", mark: 3),
                             Answer(answer: "อยากได้ผลตอบแทนที่สูง โดยไม่มีข้อจำกัดในการลงทุน", mark: 4)],
                           [ Answer(answer: "น้อยที่สุด โดยต้องการเน้นการลงทุนที่สร้างกระแสรายได้ประจำ และให้ความปลอดภัยในการลงทุนสูงสุด แม้ว่าจะได้รับผลตอบแทนในระดับที่ต่ำสุด", mark: 1),
                             Answer(answer: "รับได้ในระดับหนึ่ง โดยสามารถรับความเสี่ยงในการขาดทุนจากการลงทุนได้บ้างเพื่อเพิ่มโอกาสที่จะได้รับผลตอบแทนที่สูงขึ้นในระยะยาว", mark: 2),
                             Answer(answer: "ปานกลาง โดยสามารถรับความเสี่ยงได้พอสมควร เพื่อสร้างโอกาสในการได้รับผลตอบแทนที่สูงกว่าในระยะยาว", mark: 3),
                             Answer(answer: "มาก โดยสามารถรับความเสี่ยงได้สูงสุดเพื่อสร้างโอกาสในการได้รับผลตอบแทนที่สูงสุดในระยะยาว", mark: 4)],
                           [ Answer(answer: "เงินต้นสำหรับการลงทุนต้องปลอดภัย แม้ว่าจะได้รับผลตอบแทนต่ำกว่าอัตราเงินเฟ้อ", mark: 1),
                             Answer(answer: "รับความเสี่ยงในการสูญเสียเงินต้นได้บ้าง เพื่อคงระดับอัตราผลตอบแทนจากการลงทุนให้สูงกว่าอัตราเงินเฟ้อ", mark: 2),
                             Answer(answer: "เน้นสร้างผลตอบแทนให้สูงกว่าระดับเงินเฟ้อในระดับหนึ่ง โดยสามารถรับความเสี่ยงได้", mark: 3),
                             Answer(answer: "ต้องการให้ผลตอบแทนสูงกว่าระดับเงินเฟ้อมากที่สุดโดยสามารถรับความเสี่ยงได้เต็มที่", mark: 4)],
                           [ Answer(answer: "ต่ำกว่าร้อยละ 10", mark: 1),
                             Answer(answer: "ร้อยละ 10-20", mark: 2),
                             Answer(answer: "ร้อยละ 20-50", mark: 3),
                             Answer(answer: "มากกว่าร้อยละ 50", mark: 4)],
                           [ Answer(answer: "ได้    ", mark: 1),
                             Answer(answer: "ไม่ได้", mark: 2)]
    ]
   
    
    func getQuestions() -> [Question]{
        
        for x in 0...Questions.count-1 {
            for y in 0...anwsers[x].count-1{
                Questions[x].answerList.append(anwsers[x][y])
                
            }
        }
        return Questions
    }
}
