//
//  AssesmentDataService.swift
//  FundYoung
//
//  Created by Janjao on 23/2/2561 BE.
//  Copyright © 2561 Janjao. All rights reserved.
//

import Foundation
class AssessmentDataService {
    static let instance = AssessmentDataService()
    private let Questions = [
        Question(question: "อายุปัจจุบันของท่าน", answer1: "เกิน 60 ปี", answer2: "ตั้งแต่ 50-60 ปี", answer3: "ตั้งแต่ 35-49 ปี", answer4: "ต่ำกว่า 35 ปี"),
        Question(question: "ระดับการศึกษาของท่าน", answer1: "ต่ำกว่าปริญญาตรี", answer2: "ตั้งแต่ปริญญาตรีขึ้นไป", answer3: " ", answer4: " "),
        Question(question: "ประสบการณ์การลงทุนในหลักทรัพย์ของท่าน (หลักทรัพย์ หมายถึง หน่วยลงทุน หรือหุ้นกู้ หรือหุ้น หรือพันธบัตรรัฐบาล หรือตราสารอนุพันธ์)", answer1: "ไม่มี", answer2: "น้อยกว่า 1 ปี", answer3: "ตั้งแต่ 1-5 ปี ", answer4: "มากกว่า 5 ปี"),
        Question(question: "ระยะเวลาที่ท่านคาดว่าจะไม่จำเป็นต้องใช้เงินลงทุนในส่วนนี้", answer1: "น้อยกว่า 1 ปี", answer2: "ตั้งแต่ 1-3 ปี", answer3: "ตั้งแต่ 1-3 ปี", answer4: "มากกว่า 7 ปี"),
        Question(question: "ท่านต้องการรายได้จากเงินลงทุนในส่วนนี้เพื่อเป็นค่าใช้จ่ายประจำหรือไม่", answer1: "ต้องการมากที่สุด", answer2: "ต้องการบ้าง", answer3: "ต้องการเพียงเล็กน้อย", answer4: "ไม่มีความต้องการ"),
        Question(question: "สัดส่วนเงินลงทุนในส่วนนี้เทียบกับทรัพย์สินของท่าน", answer1: "มากกว่าร้อยละ 60", answer2: "ร้อยละ 30-60", answer3: "ร้อยละ 10-30", answer4: "น้อยกว่าร้อยละ 10"),
        Question(question: "ทัศนคติเกี่ยวกับการลงทุน", answer1: "ไม่สามารถทนต่อการขาดทุนเงินต้นได้เลย แม้ว่าจะมีโอกาสได้รับผลตอบแทนที่สูงขึ้นบ้าง", answer2: "สามารถทนต่อการขาดทุนเงินต้นได้เล็กน้อย เพื่อมีโอกาสได้รับผลตอบแทนที่สูงขึ้นบ้าง", answer3: "ตั้งแต่ 1-3 ปีสามารถทนต่อการขาดทุนเงินต้นได้ เพื่อมีโอกาสได้รับผลตอบแทนที่สูงขึ้น", answer4: "อยากได้ผลตอบแทนที่สูง โดยไม่มีข้อจำกัดในการลงทุน"),
        Question(question: "การลงทุนในหลักทรัพย์ที่มีความผันผวนสูง มักให้ผลตอบแทนที่สูงในระยะยาว แต่มีความเสี่ยงที่จะทำให้ขาดทุนได้มากขึ้นเช่นกัน ท่านสามารถรับความเสี่ยงจากการลงทุนได้ในระดับใด", answer1: "น้อยที่สุด โดยต้องการเน้นการลงทุนที่สร้างกระแสรายได้ประจำ และให้ความปลอดภัยในการลงทุนสูงสุด แม้ว่าจะได้รับผลตอบแทนในระดับที่ต่ำสุด", answer2: "รับได้ในระดับหนึ่ง โดยสามารถรับความเสี่ยงในการขาดทุนจากการลงทุนได้บ้างเพื่อเพิ่มโอกาสที่จะได้รับผลตอบแทนที่สูงขึ้นในระยะยาว", answer3: "ปานกลาง โดยสามารถรับความเสี่ยงได้พอสมควร เพื่อสร้างโอกาสในการได้รับผลตอบแทนที่สูงกว่าในระยะยาว", answer4: "มากโ ดยสามารถรับความเสี่ยงได้สูงสุดเพื่อสร้างโอกาสในการได้รับผลตอบแทนที่สูงสุดในระยะยาว"),
        Question(question: "ในบางช่วงเวลา การลงทุนโดยเน้นความปลอดภัยของเงินลงทุนจะให้ผลตอบแทนในระดับที่ต่ำกว่าเงินเฟ้อ ซึ่งอาจจะทำให้อำนาจในการซื้อลดลงได้ เมื่อพิจารณาถึงเป้าหมายในการลงทุนของท่าน ข้อใดต่อไปนี้ ตรงกับท่านมากที่สุด", answer1: "เงินต้นสำหรับการลงทุนต้องปลอดภัย แม้ว่าจะได้รับผลตอบแทนต่ำกว่าอัตราเงินเฟ้อ", answer2: "รับความเสี่ยงในการสูญเสียเงินต้นได้บ้าง เพื่อคงระดับอัตราผลตอบแทนจากการลงทุนให้สูงกว่าอัตราเงินเฟ้อ", answer3: "เน้นสร้างผลตอบแทนให้สูงกว่าระดับเงินเฟ้อในระดับหนึ่ง โดยสามารถรับความเสี่ยงได้", answer4: "ต้องการให้ผลตอบแทนสูงกว่าระดับเงินเฟ้อมากที่สุดโดยสามารถรับความเสี่ยงได้เต็มที่"),
        Question(question: "ท่านจะยอมรับผลขาดทุนจากการลงทุนในกองทุนรวมได้มากเพียงใด", answer1: "ต่ำกว่าร้อยละ 10", answer2: "ร้อยละ 10-20 ", answer3: "ร้อยละ 20-50", answer4: "มากกว่าร้อยละ 50"),
    ]
    
    func getQuestions() -> [Question]{
        return Questions
    }
}
